# დაწერეთ პროგრამა რომელიც მიიღებს არაუარყოფით მთელ რიცხვს- n.
# 0<=n<20. პროგრამამ უნდა იპოვოს 0-დან ნ-მდე წევრი . მიმდევრობა განისაზღვრება შმდეგნაირად:
# ნულოვანი წევრი არის 0, პირველი არის1 ხოლო ყოველი მომდევნო წევრი არის წინა ორი წევრის ჯამი.
# გამოიყენეთ while ციკლი და არ სეიძლება list-ის გამოყენება
# მაგალითი:
# Enter number: 5
# 0 1 1 2 3

n = int(input("please enter number[0-20): "))
a, b = 0, 1
print(a, end=" ")
if 0 <= n < 20:
    while b < n:
        print(b, end=" ")
        a, b = b, a+b
    print()
else:
    print("please enter valid number")

